PeterSommerlad/ArduinoCore-Cpp17/wsAVR/testAVRmicropinmapping/src/dummy_iom32u4.h
#define UDINT _SFR_MEM8(0xE1)
#define SUSPI 0
#define SOFI 2
#define EORSTI 3
#define WAKEUPI 4
#define EORSMI 5
#define UPRSMI 6

#define UDIEN _SFR_MEM8(0xE2)
#define SUSPE 0
#define SOFE 2
#define EORSTE 3
#define WAKEUPE 4
#define EORSME 5
#define UPRSME 6

#define UDADDR _SFR_MEM8(0xE3)
#define UADD0 0
#define UADD1 1
#define UADD2 2
#define UADD3 3
#define UADD4 4
#define UADD5 5
#define UADD6 6
#define ADDEN 7

#define UDFNUM _SFR_MEM16(0xE4)

#define UDFNUML _SFR_MEM8(0xE4)
#define FNUM0 0
#define FNUM1 1
#define FNUM2 2
#define FNUM3 3
#define FNUM4 4
#define FNUM5 5
#define FNUM6 6
#define FNUM7 7

#define UDFNUMH _SFR_MEM8(0xE5)
#define FNUM8 0
#define FNUM9 1
#define FNUM10 2

#define UDMFN _SFR_MEM8(0xE6)
#define FNCERR 4

/* Reserved [0xE7] */

#define UEINTX _SFR_MEM8(0xE8)
#define TXINI 0
#define STALLEDI 1
#define RXOUTI 2
#define RXSTPI 3
#define NAKOUTI 4
#define RWAL 5
#define NAKINI 6
#define FIFOCON 7

#define UENUM _SFR_MEM8(0xE9)
#define UENUM_0 0
#define UENUM_1 1
#define UENUM_2 2

#define UERST _SFR_MEM8(0xEA)
#define EPRST0 0
#define EPRST1 1
#define EPRST2 2
#define EPRST3 3
#define EPRST4 4
#define EPRST5 5
#define EPRST6 6

#define UECONX _SFR_MEM8(0xEB)
#define EPEN 0
#define RSTDT 3
#define STALLRQC 4
#define STALLRQ 5

#define UECFG0X _SFR_MEM8(0xEC)
#define EPDIR 0
#define EPTYPE0 6
#define EPTYPE1 7

#define UECFG1X _SFR_MEM8(0xED)
#define ALLOC 1
#define EPBK0 2
#define EPBK1 3
#define EPSIZE0 4
#define EPSIZE1 5
#define EPSIZE2 6

#define UESTA0X _SFR_MEM8(0xEE)
#define NBUSYBK0 0
#define NBUSYBK1 1
#define DTSEQ0 2
#define DTSEQ1 3
#define UNDERFI 5
#define OVERFI 6
#define CFGOK 7

#define UESTA1X _SFR_MEM8(0xEF)
#define CURRBK0 0
#define CURRBK1 1
#define CTRLDIR 2

#define UEIENX _SFR_MEM8(0xF0)
#define TXINE 0
#define STALLEDE 1
#define RXOUTE 2
#define RXSTPE 3
#define NAKOUTE 4
#define NAKINE 6
#define FLERRE 7

#define UEDATX _SFR_MEM8(0xF1)
#define DAT0 0
#define DAT1 1
#define DAT2 2
#define DAT3 3
#define DAT4 4
#define DAT5 5
#define DAT6 6
#define DAT7 7

#define UEBCX _SFR_MEM16(0xF2)

#define UEBCLX _SFR_MEM8(0xF2)
#define BYCT0 0
#define BYCT1 1
#define BYCT2 2
#define BYCT3 3
#define BYCT4 4
#define BYCT5 5
#define BYCT6 6
#define BYCT7 7

#define UEBCHX _SFR_MEM8(0xF3)

#define UEINT _SFR_MEM8(0xF4)
#define EPINT0 0
#define EPINT1 1
#define EPINT2 2
#define EPINT3 3
#define EPINT4 4
#define EPINT5 5
#define EPINT6 6




/* Interrupt Vectors */
/* Interrupt Vector 0 is the reset vector. */

#define INT0_vect_num       1
#define INT0_vect           _VECTOR(1)  /* External Interrupt Request 0 */

#define INT1_vect_num       2
#define INT1_vect           _VECTOR(2)  /* External Interrupt Request 1 */

#define INT2_vect_num       3
#define INT2_vect           _VECTOR(3)  /* External Interrupt Request 2 */

#define INT3_vect_num       4
#define INT3_vect           _VECTOR(4)  /* External Interrupt Request 3 */

#define INT6_vect_num       7
#define INT6_vect           _VECTOR(7)  /* External Interrupt Request 6 */

#define PCINT0_vect_num     9
#define PCINT0_vect         _VECTOR(9)  /* Pin Change Interrupt Request 0 */

#define USB_GEN_vect_num    10
#define USB_GEN_vect        _VECTOR(10)  /* USB General Interrupt Request */

#define USB_COM_vect_num    11
#define USB_COM_vect        _VECTOR(11)  /* USB Endpoint/Pipe Interrupt Communication Request */

#define WDT_vect_num        12
#define WDT_vect            _VECTOR(12)  /* Watchdog Time-out Interrupt */

#define TIMER1_CAPT_vect_num  16
#define TIMER1_CAPT_vect    _VECTOR(16)  /* Timer/Counter1 Capture Event */

#define TIMER1_COMPA_vect_num  17
#define TIMER1_COMPA_vect   _VECTOR(17)  /* Timer/Counter1 Compare Match A */

#define TIMER1_COMPB_vect_num   18
#define TIMER1_COMPB_vect   _VECTOR(18)  /* Timer/Counter1 Compare Match B */

#define TIMER1_COMPC_vect_num   19
#define TIMER1_COMPC_vect   _VECTOR(19)  /* Timer/Counter1 Compare Match C */

#define TIMER1_OVF_vect_num 20
#define TIMER1_OVF_vect     _VECTOR(20)  /* Timer/Counter1 Overflow */

#define TIMER0_COMPA_vect_num   21
#define TIMER0_COMPA_vect   _VECTOR(21)  /* Timer/Counter0 Compare Match A */

#define TIMER0_COMPB_vect_num   22
#define TIMER0_COMPB_vect   _VECTOR(22)  /* Timer/Counter0 Compare Match B */

#define TIMER0_OVF_vect_num 23
#define TIMER0_OVF_vect     _VECTOR(23)  /* Timer/Counter0 Overflow */

#define SPI_STC_vect_num    24
#define SPI_STC_vect        _VECTOR(24)  /* SPI Serial Transfer Complete */

#define USART1_RX_vect_num  25
#define USART1_RX_vect      _VECTOR(25)  /* USART1, Rx Complete */

#define USART1_UDRE_vect_num 26
#define USART1_UDRE_vect    _VECTOR(26)  /* USART1 Data register Empty */

#define USART1_TX_vect_num  27
#define USART1_TX_vect      _VECTOR(27)  /* USART1, Tx Complete */

#define ANALOG_COMP_vect_num 28
#define ANALOG_COMP_vect    _VECTOR(28)  /* Analog Comparator */

#define ADC_vect_num        29
#define ADC_vect            _VECTOR(29)  /* ADC Conversion Complete */

#define EE_READY_vect_num   30
#define EE_READY_vect       _VECTOR(30)  /* EEPROM Ready */

#define TIMER3_CAPT_vect_num 31
#define TIMER3_CAPT_vect    _VECTOR(31)  /* Timer/Counter3 Capture Event */

#define TIMER3_COMPA_vect_num 32
#define TIMER3_COMPA_vect   _VECTOR(32)  /* Timer/Counter3 Compare Match A */

#define TIMER3_COMPB_vect_num 33
#define TIMER3_COMPB_vect   _VECTOR(33)  /* Timer/Counter3 Compare Match B */

#define TIMER3_COMPC_vect_num 34
#define TIMER3_COMPC_vect   _VECTOR(34)  /* Timer/Counter3 Compare Match C */

#define TIMER3_OVF_vect_num 35
#define TIMER3_OVF_vect     _VECTOR(35)  /* Timer/Counter3 Overflow */

#define TWI_vect_num        36
#define TWI_vect            _VECTOR(36)  /* 2-wire Serial Interface         */

#define SPM_READY_vect_num  37
#define SPM_READY_vect      _VECTOR(37)  /* Store Program Memory Read */

#define TIMER4_COMPA_vect_num 38
#define TIMER4_COMPA_vect   _VECTOR(38)  /* Timer/Counter4 Compare Match A */

#define TIMER4_COMPB_vect_num 39
#define TIMER4_COMPB_vect   _VECTOR(39)  /* Timer/Counter4 Compare Match B */

#define TIMER4_COMPD_vect_num 40
#define TIMER4_COMPD_vect   _VECTOR(40)  /* Timer/Counter4 Compare Match D */

#define TIMER4_OVF_vect_num 41
#define TIMER4_OVF_vect     _VECTOR(41)  /* Timer/Counter4 Overflow */

